import React from "react";
import jalali from "../../assets/jalali.jpg";
import mojtahedi from "../../assets/mojtahedi.jpg";
import purmohammad from "../../assets/purmohammad.jpg";
import farajpour from "../../assets/farajpour.jpg";
import mirzaei from "../../assets/mirzaei.jpg";
import malekzadeh from '../../assets/malekzadeh.jpg'
import './cmitems.css'
import CmItems from "./CmItems";

import "../Comments/cmusers.css";

const CmContainer = () => {

  const x = [
    {
      user: "علی جلالی",
      profilepicture: jalali,
      userscomment:
        "من در چند دوره‌ی ویدیویی و حضوری آموزش برنامه نویسی شرکت کرده بودم، ولی با حضور در دوره‌های ری‌اکت و نود جی‌اس استاد صدری به عمیق‌ترین مفاهیم برنامه نویسی جاوااسکریپت پی بردم. روش تدریس ایشون رو تا به حال در هیچ کدوم از دوره‌های مشابه ندیده بودم. از مفاهیم بسیار ساده شروع شده و پله پله بدون اینکه کسی لحظه‌ای از کلاس عقب بمونه تمام حاضرین رو تا رسیدن به پیشرفته‌ترین مراحل با خودشون همراه می‌کردن. من به شخصه کل پیشرفت‌هایی که در زمینه برنامه نویسی داشتم رو مدیون ایشون هستم. بعد از اتمام دوره‌ها توسط ایشون به یک شرکت دانش بنیان معرفی شدم و هم اکنون با این شرکت در حال همکاری هستم. ",
    },
    {
      user: "سودا مجتهدی",
      profilepicture: mojtahedi,
      userscomment:
        "در كلاس طراحى و مبانى برنامه نويسى وب با استاد صدرى آشنا شدم و با توجه به تسلط كامل و قدرت بيان قوى علاقه‌ام به برنامه نويسى بيشتر شد و دوره هاى جاوااسكريپت و ري‌اكت را با جناب آقاى صدرى ادامه دادم و الان تو شركت دانش بنيان مشغول به كار هستم. پيشنهاد مي‌كنم اگر واقعا علاقه‌مند به برنامه نويسى هستيد دوره‌هاى آقاى صدرى را از دست ندید.",
    },
    {
      user: "پرستو پورمحمد",
      profilepicture: purmohammad,
      userscomment:
        "یکی از معدود اساتیدی که واقعا براشون مهمه که دانشجوها مطلب رو دقیق و کامل یاد بگیرن، برای همین با مطرح کردن سوالات و تمرین‌های متنوع و مفید، انگیزه قوی برای یادگیری ایجاد می کنن که نوع تدریس، نشان دهنده تسلط کامل روی مطلب هست. همیشه روی کد نویسی اصولی خیلی تاکید می‌کنن که این کار، برای دسترسی سریع به کدها و رفع خطای کد خیلی مهم و کاربردی هست، برای خود منم توجه به این موضوع خیلی مفید بوده همیشه.",
    },
    {
      user: "مجتبی فرجپور",
      profilepicture: farajpour,
      userscomment:
        "در كلاس طراحى و مبانى برنامه نويسى وب با استاد صدرى آشنا شدم و با توجه به تسلط كامل و قدرت بيان قوى علاقه‌ام به برنامه نويسى بيشتر شد و دوره هاى جاوااسكريپت و ري‌اكت را با جناب آقاى صدرى ادامه دادم و الان تو شركت دانش بنيان مشغول به كار هستم. پيشنهاد مي‌كنم اگر واقعا علاقه‌مند به برنامه نويسى هستيد دوره‌هاى آقاى صدرى را از دست ندید.",
    },
    {
      user: "شبنم میرزایی",
      profilepicture: mirzaei,
      userscomment:
        "در کلاس جاوا اسکریپت با استاد صدری آشنا شدم. تدریس عالی و تشویقهای مستمرشون باعث شد بعد از وقفه طولانی دوباره به سمت برنامه نویسی برگردم. در کلاسهای نود ایشون شرکت کردم و علاوه بر اون از ویدیوهای آموزشی ری اکت و آخرین ویدیوهای بی نظیر نود ایشون استفاده زیادی بردم. خیلی خیلی خوشحالم که باهاشون آشنا شدم؛ کاش که خیلیی زودتر این اتفاق افتاده بود.",
    },
    {
      user: "محمد مهدی ملک زاده",
      profilepicture: malekzadeh,
      userscomment:
        "در اولین فرصت تئنستم برم دنبالش و  در بهترین مسیر قرار بگیر که به حول قوه ی پروردگار بزرگ و بلند مرتبه",
    },
  ];
  //چرا باید حروف کوچیک بنویسیم

  return (
    <section className="cmcontainer">
      {x.map((item) => {
        return (
          <CmItems
            name={item.user}
            picture={item.profilepicture}
            comment={item.userscomment}
          />
        );
      })}
    </section>
  );
};

export default CmContainer;
