// import React from "react";
// import mojtahedi from "../../assets/mojtahedi.jpg";
// const Second = () => {
//   return (
//     <div className="secondcm">
//       <h4 className="secondcm-h4">سودا مجتهدی</h4>
//       <img src={mojtahedi} alt="mohajeri"  className="secondcm-img"/>
//       <p className="secondcm-p">
//         یکی از دلایل مهمی که باعث تمایز دوره‌های فرانت کست از بقیه می‌شه تایم
//         کوتاه ویدیوها و کیفیت بسیار بالای اون‌هاست. به شکلی که پیچیده‌ترین
//         مفاهیم به‌صورت خیلی ساده به دانشجو منتقل می‌شه و دلیل این هم فقط تسلط
//         بسیار عالی استاد صدری روی مباحث و قدرت انتقال قوی ایشون هست. این موضوع
//         خیلی کمک می‌کنه که فرآیند یادگیری اصلا خسته‌کننده نباشه. همینطور چالش‌ها
//         و تمرین‌هایی که در طول دوره مطرح می‌شه خیلی کمک می‌کنه تا یادگیری مفاهیم
//         به شکل عمیق صورت بگیره و یه انگیزه خیلی قوی هم برای ادامه دادن مسیر هست.
//       </p>
//     </div>
//   );
// };

// export default Second;
